# SQL Lab

Congratulations! We've been hired as analysts at Classic Model Car Company, and you've been handed keys to the Data Warehouse.  They want you to hit the ground running with analysis! We have lots of questions to answer.  First, let's connect to the database.

1. Connect via MySQL Credentials
  - hostname: `hbs-ds-060120.c1doesqrid0e.us-east-1.rds.amazonaws.com`
  - username: `hbs-student`
  - password: (distributed via slack)
  - port: 3306 (default)
  - database: `classicmodels`

2. Take a moment to study the schema, noting the keys. Browse the data in each relation if you wish. Answer the following queries. I've given you the expected results below each query.

3. Answer the following questions! Do them in your MySQL client first, most likely, then bring them into Pandas here in this notebook.

1. List all customer names and their addresses who don't have a specified sales rep. Order by customer name.

In [2]:
!pip install MySQL-connector-python

Collecting MySQL-connector-python
  Downloading mysql_connector_python-8.0.20-cp37-cp37m-macosx_10_14_x86_64.whl (4.8 MB)
     |████████████████████████████████| 4.8 MB 2.1 MB/s eta 0:00:01
Collecting protobuf>=3.0.0
  Downloading protobuf-3.12.2-cp37-cp37m-macosx_10_9_x86_64.whl (1.3 MB)
     |████████████████████████████████| 1.3 MB 26.3 MB/s eta 0:00:01
Requirement already satisfied: six>=1.9 in /Users/kcahlers/Applications/anaconda3/lib/python3.7/site-packages (from protobuf>=3.0.0->MySQL-connector-python) (1.14.0)
Requirement already satisfied: setuptools in /Users/kcahlers/Applications/anaconda3/lib/python3.7/site-packages (from protobuf>=3.0.0->MySQL-connector-python) (46.0.0.post20200309)
Installing collected packages: protobuf, MySQL-connector-python
Successfully installed MySQL-connector-python-8.0.20 protobuf-3.12.2

In [12]:
import pandas as pd
import mysql.connector

con = mysql.connector.connect(user='hbs-student', password='super-secure-password?',
                              host='hbs-ds-060120.c1doesqrid0e.us-east-1.rds.amazonaws.com',
                              database='classicmodels')

In [32]:
pd.read_sql_query("""
-- List all customer names and their addresses who don't have a specified sales rep. Order by customer name.
SELECT 
    contactlastname,
    contactfirstname,
    addressline1,
    addressline2,
    city,
    state,
    postalCode
FROM
    customers
WHERE
    salesRepEmployeeNumber IS NULL
ORDER BY contactLastName;
""", con)

,contactlastname,contactfirstname,addressline1,addressline2,city,state,postalCode
0,"Altagar,G M",Raanan,3 Hagalim Blv.,None,Herzlia,None,47625
1,Andersen,Mel,Obere Str. 57,None,Berlin,None,12209
2,Anton,Carmen,"c/ Gobelas, 19-1 Urb. La Florida",None,Madrid,None,28023
3,Camino,Alejandra,"Gran Vía, 1",None,Madrid,None,28001
4,Cramer,Philip,Maubelstr. 90,None,Brandenburg,None,14776
5,de Castro,Isabel,Estrada da saúde n. 58,None,Lisboa,None,1756
6,Feuer,Alexander,Heerstr. 22,None,Leipzig,None,04179
7,Franken,Peter,Berliner Platz 43,None,München,None,80805
8,Harrison,Ed,Rte des Arsenaux 41,None,Fribourg,None,1700
9,Josephs,Karin,Luisenstr. 48,None,Münster,None,44087
10,Kloss,Horst,Taucherstraße 10,None,Cunewalde,None,01307
11,Kuger,Armand,1250 Pretorius Street,None,Hatfield,Pretoria,0028
12,McKenna,Patricia,8 Johnstown Road,None,Cork,Co. Cork,None
13,Messner,Renate,Magazinweg 7,None,Frankfurt,None,60528
14,Moos,Hanna,Forsterstr. 57,None,Mannheim,None,68306
15,Müller,Rita,Adenauerallee 900,None,Stuttgart,None,70563
16,Ottlieb,Sven,Walserweg 21,None,Aachen,None,52066
17,Piestrzeniewicz,Zbyszek,ul. Filtrowa 68,None,Warszawa,None,01-012
18,Rodriguez,Lino,Jardim das rosas n. 32,None,Lisboa,None,1675
19,Schuyler,Bradley,Kingsfordweg 151,None,Amsterdam,None,1043 GR
20,Semenov,Alexander,2 Pobedy Square,None,Saint Petersburg,None,196143
21,Walker,Brydey,Suntec Tower Three,8 Temasek,Singapore,None,038988

In [4]:
query = """
-- List all customer names and their addresses who don't have a specified sales rep. Order by customer name.
SELECT 
    contactlastname,
    contactfirstname,
    addressline1,
    addressline2,
    city,
    state,
    postalCode
FROM
    customers
WHERE
    salesRepEmployeeNumber IS NULL
ORDER BY contactLastName;
"""

In [7]:
cursor=con.cursor()

2. List the names of all customers that have a creditLimit between 100,000 and 200,000 inclusively. Order by customer name.

In [36]:
cursor.execute(query)
cursor.fetchmany(5)

[('Altagar,G M', 'Raanan', '3 Hagalim Blv.', None, 'Herzlia', None, '47625'),
 ('Andersen', 'Mel', 'Obere Str. 57', None, 'Berlin', None, '12209'),
 ('Anton',
  'Carmen',
  'c/ Gobelas, 19-1 Urb. La Florida',
  None,
  'Madrid',
  None,
  '28023'),
 ('Camino', 'Alejandra ', 'Gran Vía, 1', None, 'Madrid', None, '28001'),
 ('Cramer', 'Philip ', 'Maubelstr. 90', None, 'Brandenburg', None, '14776')]

In [17]:
!ls data/

classicmodels.db classmodels.sql

In [8]:
import sqlite3

con_sqlite=sqlite3.connect('data/classicmodels.db')
cur_sqlite=con_sqlite.cursor()

In [5]:
test = pd.read_sql_query(query,con)


3. List all employees who have the initials of M.P. or P.M., by name. Order by last name.

In [10]:
cur.execute(""" SELECT firstname, lastname 
from employees 
where (firstname like 'M%' and lastname like 'P%')
OR (firstname like 'P%' and lastname like 'M%')
order by lastname""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

  firstname   lastname
0     Peter      Marsh
1      Mary  Patterson

4. List all the products' productNames purchased by Mini Wheels Co. Order the list by product line.

In [14]:
query2="""
SELECT distinct productName 
from products
join orderdetails
using (productcode)
join orders
using (ordernumber)
join customers
using(customernumber)
where customername = 'Mini Wheels Co.'
Order by productline
"""
pd.read_sql_query(query2,con)

                                    productName
0                      1952 Alpine Renault 1300
1         1969 Harley Davidson Ultimate Chopper
2          2003 Harley-Davidson Eagle Drag Bike
3           1936 Harley Davidson El Knucklehead
4                      1960 BSA Gold Star DBD34
5                         1996 Moto Guzzi 1100i
6                              2002 Suzuki XREO
7                             1997 BMW R 1100 S
8                                1958 Setra Bus
9   1996 Peterbilt 379 Stake Bed with Outrigger
10                       1940 Ford Pickup Truck
11                         1937 Lincoln Berline
12                           1934 Ford V8 Coupe
13                     1917 Maxwell Touring Car
14                  1913 Ford Model T Speedster
15     1936 Mercedes-Benz 500K Special Roadster
16          18th Century Vintage Horse Carriage
17                        1936 Chrysler Airflow
18                      1939 Cadillac Limousine

5. List the customers by customerName whose contact person shares either a first name or last name with any of the company's employees Order by customerName

In [18]:
query3 = """
SELECT  customername
from customers c
where (c.contactlastname in 
(select lastname from employees))
or 
(c.contactfirstname in
(select firstname from employees))
order by customername
"""
pd.read_sql_query(query3,con)

                    customername
0     Australian Collectors, Co.
1        Auto-Moto Classics Inc.
2              Boards & Toys Co.
3     Cambridge Collectables Co.
4           Classic Legends Inc.
5   Collectable Mini Designs Co.
6       Corporate Gift Ideas Co.
7     Corrida Auto Replicas, Ltd
8              Franken Gifts, Co
9                Gift Depot Inc.
10          Marta's Replicas Co.
11                 Mini Classics
12               Mini Wheels Co.
13            Muscle Machine Inc
14        Saveley & Henriot, Co.
15            Signal Gift Stores
16              Super Scale Inc.
17       Tekni Collectables Inc.
18             Toys4GrownUps.com
19   West Coast Collectables Co.

7. List the customers (by name) that are based in the country which is first in the lexicographic order of customer countries. Order by customerName

In [19]:
query4 = """
SELECT customername
from customers 
where country = 
(select min(country)from customers)
Order by 1"""
pd.read_sql_query(query4,con)

                   customername
0       Anna's Decorations, Ltd
1  Australian Collectables, Ltd
2    Australian Collectors, Co.
3   Australian Gift Network, Co
4     Souveniers And Things Co.

8. Identify the product(s) by productCode and productName that the company has the least stock of. Order by product code.

In [21]:
query5="""
SELECT productcode,productname
from products
where quantityinstock = 
(select min(quantityinstock) from products)
order by  productcode

"""
pd.read_sql_query(query5,con)

  productcode               productname
0    S24_2000  1960 BSA Gold Star DBD34

9. Identify the offices (by city) that have the least employees and the most employees (answer should include city, numEmps)

In [38]:
cur.execute("""
SELECT city, count(*) as employeeCount
FROM employees
JOIN offices USING (officeCode)
GROUP BY officeCode, city

HAVING employeeCount in (
	SELECT max(employeeCount)
	FROM (
	SELECT officeCode, count(*) as employeeCount
	FROM employees
	GROUP BY officeCode) AS max_count
    UNION
    SELECT min(employeeCount)
	FROM (
	SELECT officeCode, count(*) as employeeCount
	FROM employees
	GROUP BY officeCode) AS min_count
)
""")
df3= pd.DataFrame(cur.fetchall())
df3.columns = [x[0] for x in cur.description]
df3

            city  employeeCount
0  San Francisco              6
1         Boston              2
2            NYC              2
3          Tokyo              2
4         London              2

10. For all Sales Reps list their names (first and last) and the name of the office they work out of and the number of clients they represent. Order by reverse order of numClients

In [41]:
query6 = """
SELECT firstname,lastname,offices. city, count(distinct customernumber) as num_clients
from employees join offices using (officecode)
join customers on employeenumber = salesrepemployeenumber
group by 1,2,3
order by 4 desc

"""
pd.read_sql_query(query6,con)

   firstname   lastname           city  num_clients
0     Pamela   Castillo          Paris           10
1      Barry      Jones         London            9
2      Larry       Bott         London            8
3     George     Vanauf            NYC            8
4     Gerard  Hernandez          Paris            7
5   Foon Yue      Tseng            NYC            7
6     Leslie   Jennings  San Francisco            6
7       Loui     Bondur          Paris            6
8      Steve  Patterson         Boston            6
9     Martin     Gerard          Paris            6
10    Leslie   Thompson  San Francisco            6
11     Julie   Firrelli         Boston            6
12     Peter      Marsh         Sydney            5
13      Mami      Nishi          Tokyo            5
14      Andy     Fixter         Sydney            5

11. List the customer(s) and their total payments (answer should include customerNumber, customerName, totalPayment where totalPayment is the total amount of dollars the customer has paid). Order by totalPayment.

In [44]:
query7 = """SELECT customers.customernumber,customername, sum(amount) as totalpayment
from customers join payments using (customernumber)
group by 1,2
order by 3 
"""
pd.read_sql_query(query7,con)

    customernumber                  customername  totalpayment
0              219             Boards & Toys Co.       7918.60
1              198       Auto-Moto Classics Inc.      21554.26
2              103             Atelier graphique      22314.36
3              473            Frau da Collezione      25358.32
4              381                  Royale Belge      29217.18
..             ...                           ...           ...
93             148       Dragon Souveniers, Ltd.     156251.03
94             151            Muscle Machine Inc     177913.95
95             114    Australian Collectors, Co.     180585.07
96             124  Mini Gifts Distributors Ltd.     584188.24
97             141        Euro+ Shopping Channel     715738.98

[98 rows x 3 columns]

12. List the product number, product name, and customer name such that the customer has never ordered that product. Order by customerName, productCode.

In [45]:
query8=""" SELECT * from(
	(SELECT productcode as pca, productname as pna , customername as cna
	from products p cross join customers c) all_combos 
left join
(
select productcode as pco, customername as cno
from orderdetails join orders using (ordernumber)
join customers using (customernumber)
) orders
ON pca = pco AND cna=cno)
where pco is null
order by cna, pca

"""
pd.read_sql_query(query8,con)

,pca,pna,cna,pco,cno
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Alpha Cognac,None,None
1,S10_1949,1952 Alpine Renault 1300,Alpha Cognac,None,None
2,S10_2016,1996 Moto Guzzi 1100i,Alpha Cognac,None,None
3,S10_4698,2003 Harley-Davidson Eagle Drag Bike,Alpha Cognac,None,None
4,S10_4962,1962 LanciaA Delta 16V,Alpha Cognac,None,None
...,...,...,...,...,...
10883,S700_3505,The Titanic,West Coast Collectables Co.,None,None
10884,S700_3962,The Queen Mary,West Coast Collectables Co.,None,None
10885,S700_4002,American Airlines: MD-11S,West Coast Collectables Co.,None,None
10886,S72_1253,Boeing X-32A JSF,West Coast Collectables Co.,None,None
10887,S72_3212,Pont Yacht,West Coast Collectables Co.,None,None

13. List the profit per product that the company would make if it were able to sell all of that product at MSRP (answer should include productName, profit). Order by profit.

In [47]:
query9="""
SELECT productname, (msrp - buyprice) as profit from products order by 2 desc
"""
pd.read_sql_query(query9,con)

                              productname  profit
0                1952 Alpine Renault 1300  115.72
1                       2001 Ferrari Enzo  112.21
2    2003 Harley-Davidson Eagle Drag Bike  102.64
3                       1968 Ford Mustang   99.23
4                  1928 Mercedes-Benz SSK   96.19
..                                    ...     ...
105      1936 Mercedes Benz 500k Roadster   19.28
106                      Boeing X-32A JSF   16.89
107          1930 Buick Marquette Phaeton   16.58
108                     1982 Ducati 996 R   16.09
109           1939 Chevrolet Deluxe Coupe   10.62

[110 rows x 2 columns]

14. List the average order size for each customer (answer should include customerName, avgQuantity) Order by customer name.

In [51]:
query10="""select customername, avg(quantityordered) as avg_order_size
from orderdetails join orders using (ordernumber) 
join customers using (customernumber)
group by 1
"""
pd.read_sql_query(query10,con)

                    customername  avg_order_size
0                   Alpha Cognac         34.3500
1             Amica Models & Co.         32.4231
2        Anna's Decorations, Ltd         31.9348
3              Atelier graphique         38.5714
4   Australian Collectables, Ltd         30.6522
..                           ...             ...
93         UK Collectables, Ltd.         36.0690
94               Vida Sport, Ltd         34.7742
95               Vitachrome Inc.         31.4800
96      Volvo Model Replicas, Co         34.0526
97   West Coast Collectables Co.         39.3077

[98 rows x 2 columns]